Revit 2026 API

# CitySetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CitySetIterator()
```
```vb
Public Sub New
```
```cpp
public:
CitySetIterator()
```
```fsharp
new : unit -> CitySetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

CitySetIterator Class

Autodesk.Revit.DB Namespace